testing/load-test.yml
# ================================================
# 🚀 LOAD TESTING - Flores Victoria
# ================================================
# Pruebas de carga con Artillery
# Objetivo: P95 < 500ms, Error rate < 1%

config:
  target: 'http://localhost:3000'
  phases:
    # Fase 1: Warmup (30 segundos, 10 usuarios/seg)
    - duration: 30
      arrivalRate: 10
      name: "Warmup"
    
    # Fase 2: Ramp up (60 segundos, 10 -> 50 usuarios/seg)
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    
    # Fase 3: Sustained load (120 segundos, 50 usuarios/seg)
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    
    # Fase 4: Spike (30 segundos, 100 usuarios/seg)
    - duration: 30
      arrivalRate: 100
      name: "Spike test"
    
    # Fase 5: Cool down (30 segundos, 10 usuarios/seg)
    - duration: 30
      arrivalRate: 10
      name: "Cool down"

  # Timeouts
  timeout: 10
  
  # Variables
  variables:
    testUserId: "test-user-{{ $randomNumber(1000, 9999) }}"
  
  # Processor
  processor: "./artillery-helpers.js"
  
  # Plugins
  plugins:
    expect:
      outputFormat: 'pretty'
    metrics-by-endpoint:
      stripQueryString: true
      excludeUnmatchedRequests: false

  # Métricas personalizadas
  ensure:
    maxErrorRate: 1              # Error rate < 1%
    p95: 500                     # P95 < 500ms
    p99: 1000                    # P99 < 1s

scenarios:
  # ================================================
  # 1. FLUJO DE USUARIO COMPLETO
  # ================================================
  - name: "Complete User Journey"
    weight: 40
    flow:
      # Homepage
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: text/html
            - hasHeader: "x-response-time"
      
      # Ver productos
      - think: 2
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
            - contentType: json
      
      # Ver producto específico
      - think: 3
      - get:
          url: "/api/products/{{ $randomNumber(1, 50) }}"
          expect:
            - statusCode: [200, 404]
      
      # Agregar al carrito
      - think: 2
      - post:
          url: "/api/cart/add"
          json:
            productId: "{{ $randomNumber(1, 50) }}"
            quantity: "{{ $randomNumber(1, 3) }}"
          expect:
            - statusCode: [200, 201, 401]
      
      # Ver carrito
      - think: 1
      - get:
          url: "/api/cart"
          expect:
            - statusCode: [200, 401]

  # ================================================
  # 2. SOLO NAVEGACIÓN (READ-ONLY)
  # ================================================
  - name: "Browse Products"
    weight: 30
    flow:
      - get:
          url: "/api/products?page={{ $randomNumber(1, 5) }}"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/api/products/featured"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: "/api/products/categories"
          expect:
            - statusCode: 200

  # ================================================
  # 3. BÚSQUEDA
  # ================================================
  - name: "Search Products"
    weight: 15
    flow:
      - get:
          url: "/api/products/search?q={{ $randomWord() }}"
          expect:
            - statusCode: 200
            - contentType: json
      
      - think: 1
      
      - get:
          url: "/api/products/search?q=rosas"
          expect:
            - statusCode: 200

  # ================================================
  # 4. AUTENTICACIÓN
  # ================================================
  - name: "Authentication Flow"
    weight: 10
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber(1, 100) }}@example.com"
            password: "Test1234!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]
      
      # Si login exitoso, obtener perfil
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

  # ================================================
  # 5. STRESS TEST API ESPECÍFICOS
  # ================================================
  - name: "API Stress Test"
    weight: 5
    flow:
      # Health check
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      
      # Cart service
      - get:
          url: "/api/cart/health"
          expect:
            - statusCode: 200
      
      # Product service
      - get:
          url: "/api/products/health"
          expect:
            - statusCode: 200
      
      # Auth service
      - get:
          url: "/api/auth/health"
          expect:
            - statusCode: 200